import * as React from 'react';

const Home = () => (
  <div>
    
    <h1>О проекте</h1>
    <p> На протяжении многих лет фольклорная практика была традиционным летним заданием студентов филологических факультетов в разных вузах нашей страны. В Уральском Федеральном университете хранятся и материалы экспедиций более чем пятидесятилетней давности, и результаты работы студентов в XXI веке. По обширному архиву Свердловской области можно составить географию фольклорных практик в разные годы. Встречаются среди собраний и тексты, записанные в маленьких деревнях нашего региона. При взгляде на многочисленные названия населенных пунктов возникает вопрос, все ли из них существуют в наши дни. Используя результаты Всероссийской переписи населения 2010 г, мы выяснили, что среди сельских населенных пунктов, представленных в описях 1960-1970-х годов, пятьдесят один можно отнести к категории «исчезающие»1. При составлении карты, указывающей на расположение подобных населенных пунктов, было обнаружено «созвездие» исчезающих деревень на границе Алапаевского и Верхотурского районов. Всего было насчитано 13 населенных пунктов, находящихся под угрозой исчезновения. Алапаевский район: дер. Кузина, Маскалка, Перевалова, Пурегова, Толстова, Трошкова, Турутина. Верхотурский район: дер. Бочкарева, Запольская, Лебедева, Малахова, Отраднова, Путимка.</p>

<p>Можно сказать, что тексты, собранные студентами более полувека назад, являются единственной памятью о деревнях, в которых сейчас почти никто не живет.</p>

<p>Чтобы сохранить эти материалы и ввести их в научный оборот, нами был создан этот корпус текстов. Он позволяет осуществлять поиск по метатекстовым данным (жанр текста, год и место сбора, возраст информанта). Также возможен поиск по отдельным словоформам.</p>

<p>Стоит отметить, что при создании корпуса был выполнен морфологический анализ всех словоформ. Первичный анализ был осуществлен при помощи программы MyStem, разработанной компанией «Яндекс». Анализ диалектных форм был выполнен вручную.</p>

<p>Таким образом, данный корпус позволит осуществлять поиск текстов по базовым параметрам, а также даст представление о морфологических особенностях, которые прослеживаются в выбранном нами материале.</p>
  </div>
);

export default Home;
